Repository: BravoBaldo/Translations
Catalog: LVGL/LVGL_TradIta/LVGL_TradIta-omegat.tmx
Source language: en_us
Languages: it_it

source: Windows: Recommended: ``vcpkg install sdl2`` Alternatively, you can download prebuilt SDL2 binaries from the `SDL website <https://www.libsdl.org/download-2.0.php>`__ and follow their installation instructions.
it_it: Windows: Consigliato: ``vcpkg install sdl2`` In alternativa, si possono scaricare i binari SDL2 precompilati dal `sito web di SDL <https://www.libsdl.org/download-2.0.php>`__ e seguire le relative istruzioni di installazione.

source: With *Encoder* decrement/increment the selected digit.
it_it: Con L'*Encoder* decrementa/incrementa la cifra selezionata.

source: With :cpp:expr:`lv_display_set_user_data(display1, p)` a custom pointer can be stored with ``lv_display_t`` object.
it_it: Con :cpp:expr:`lv_display_set_user_data(display1, p)` è possibile memorizzare un puntatore personalizzato nell'oggetto ``lv_display_t``.

source: With :cpp:expr:`lv_image_set_offset_x(img, x_ofs)` and :cpp:expr:`lv_image_set_offset_y(img, y_ofs)`, you can add some offset to the displayed image.
it_it: Con :cpp:expr:`lv_image_set_offset_x(img, x_ofs)` e :cpp:expr:`lv_image_set_offset_y(img, y_ofs)`, è possibile aggiungere un offset all'immagine visualizzata.

source: With :cpp:expr:`lv_label_set_text_fmt(label, fmt, ...)` printf formatting can be used to set the text.
it_it: Con :cpp:expr:`lv_label_set_text_fmt(label, fmt, ...)` è possibile utilizzare la formattazione printf per impostare il testo.

source: With Button Matrix, each button uses only eight extra bytes of memory instead of the ~100-150 bytes a normal :ref:`Button <lv_button>` Widget plus the 100 or so bytes for the :ref:`Label <lv_label>` Widget.
it_it: Con la Button Matrix, ogni pulsante utilizza solo otto byte di memoria aggiuntivi invece dei circa 100-150 byte di un normale Widget :ref:`Button <lv_button>` più i circa 100 byte per il Widget :ref:`Label <lv_label>`.

source: With C, each iteration consists of ``Change code`` > ``Build`` > ``Flash`` > ``Run``.
it_it: In C, ogni iterazione consiste in ``Modifica del codice`` > ``Build`` > ``Flash`` > ``Run``.

source: With OpenGL, the type is ``unsigned int``.
it_it: Con OpenGL, il tipo è ``unsigned int``.

source: With PlatformIO, you can also override the configuration using build_flags in ``platformio.ini``, which avoids editing library files directly.
it_it: Con PlatformIO, è anche possibile sovrascrivere la configurazione utilizzando build_flags in ``platformio.ini``, evitando di modificare direttamente i file della libreria.

source: With `LV_BLUR_QUALITY_AUTO` the quality will be selected automatically.
it_it: Con `LV_BLUR_QUALITY_AUTO`, la qualità verrà selezionata automaticamente.

source: With ``LV_USE_LAYER_DEBUG`` on...
it_it: Con ``LV_USE_LAYER_DEBUG`` attivo...

source: With `lv_binding_js <https://github.com/lvgl/lv_binding_js>`__ you can use LVGL from within JavaScript.
it_it: Con `lv_binding_js <https://github.com/lvgl/lv_binding_js>`__ si può usare LVGL dall'interno di JavaScript.

source: With a Switch is created, its default orientation is :cpp:enumerator:`LV_SWITCH_ORIENTATION_AUTO`, which causes it to be oriented based on ``width`` and ``height``.
it_it: Quando viene creato uno Switch, il suo orientamento predefinito è :cpp:enumerator:`LV_SWITCH_ORIENTATION_AUTO`, che ne determina l'orientamento in base a ``width`` e ``height``.

source: With a different STM32CubeIDE project, you can configure the libraries to be linked by right-clicking the project in the "Project Explorer" sidebar, clicking "Properties", navigating to "C/C++ Build", "Settings", "MCU G++ Linker", and then "Libraries".
it_it: Con un diverso progetto STM32CubeIDE, è possibile configurare le librerie da linkare cliccando col pulsante destro del mouse sul progetto nella barra laterale "Project Explorer", selezionando "Properties", andando su "C/C++ Build", "Settings", "MCU G++ Linker" e quindi su "Libraries".

source: With each call to that function, the newly-created draw unit is added to the head of that list, pushing already-existing draw units further back in the list, pushing the Draw Units created earlier farther back in the list.
it_it: A ogni chiamata a questa funzione, la draw unit appena creata viene aggiunta in cima a tale elenco, spostando le draw unit già esistenti più indietro nell'elenco, e le Draw Unit create in precedenza ancora più indietro.

source: With indexed color formats (``LV_COLOR_FORMAT_I1/2/4/8``) pass the color index as the ``color`` argument by using the *blue* channel in the ``color`` value, e.g. :cpp:expr:`lv_color_make(0, 0, index)`.
it_it: Con i formati di colore indicizzati (``LV_COLOR_FORMAT_I1/2/4/8``) si passa l'indice del colore come argomento ``color`` utilizzando il canale *blu* nel valore ``color`` ad esempio :cpp:expr:`lv_color_make(0, 0, index)`.

source: With lower brightness the color of the LED becomes darker.
it_it: Con una luminosità inferiore, il colore del LED diventa più scuro.

source: With the REPL (interactive prompt) you can type commands and execute them immediately, run scripts, etc.
it_it: Con REPL (prompt interattivo) è possibile digitare comandi ed eseguirli immediatamente, eseguire script, ecc.

source: With the following functions you can cause any parent Widget to have Grid-layout behaviors.
it_it: Con le seguenti funzioni è possibile impostare qualsiasi Widget padre su un layout Grid.

source: With the help of :ref:`Scale <lv_scale>`, vertical and horizontal scales can be added in a very flexible way.
it_it: Con l'aiuto di :ref:`Scale <lv_scale>`, è possibile aggiungere scale verticali e orizzontali in modo molto flessibile.

source: With the help of :ref:`Subjects <observer_subject>`, the interface of the UI can be created.
it_it: Con l'aiuto dei :ref:`Soggetti <observer_subject>`, è possibile creare l'interfaccia utente.

source: With the help of FrogFS, a "blob" (binary file) can be created from a folder containing all XMLs, images, and fonts.
it_it: Con l'aiuto di FrogFS, è possibile creare un "blob" (file binario) da una cartella contenente tutti i file XML, le immagini e i font.

source: With the help of ``lv_dpx``, only the pixel values can be scaled.
it_it: Con l'aiuto di ``lv_dpx``, è possibile ridimensionare solo i valori in pixel.

source: With the help of a "slot" any UI element in the component can be easily exposed as a parent that can be referenced later and children can be created there.
it_it: Con l'aiuto di uno "slot", qualsiasi elemento dell'interfaccia utente nel componente può essere facilmente esposto come elemento padre, a cui è possibile fare riferimento in seguito, e al quale è possibile creare elementi figlio.

source: With the help of consistent and easy-to-learn API functions you can create widgets (buttons, sliders, charts, etc), style them, add events, layouts, or animations.
it_it: Con l'aiuto di funzioni API coerenti e facili da apprendere, è possibile creare widget (pulsanti, slider, grafici, ecc.), personalizzarli, aggiungere eventi, layout o animazioni.

source: With these modifications, you can now run the image recipe again::
it_it: Con queste modifiche, ora si può eseguire nuovamente la ricetta dell'immagine:

source: With this mode configured, scrolling and drawing is as fast as with "normal" short text.
it_it: Con questa modalità configurata, lo scorrimento e il disegno sono veloci quanto con il testo breve "normale".

source: With zero padding the knob size is the same as the indicator's width.
it_it: Con padding zero, la dimensione della manopola è uguale alla larghezza dell'indicatore.

source: Without Clip Corner Style
it_it: Senza lo Syile "Clip Corner"

source: Without VG, more task types will be performed by the software renderer.
it_it: Senza VG, il renderer software eseguirà più tipi di attività.

source: Without this, Arduino won’t locate the header file and will throw "No such file or directory" errors.
it_it: Senza questo, Arduino non individuerà il file header e genererà errori "No such file or directory".

source: Words are separated by '\_'
it_it: Le parole sono separate da '\_'

source: Working on a Project
it_it: Lavorare su un Progetto

source: Works for BT81x too.
it_it: Funziona anche per BT81x.

source: Wrapping at exactly column 86 is not important, but readability and ease of editing is.
it_it: Non è importante che il testo vada esattamente a capo alla colonna 86, ma lo sono la leggibilità e la facilità di modifica.

source: Write a parser
it_it: Scrivere un parser

source: Write functions that use the single-responsibility principle.
it_it: Scrivere funzioni che utilizzano il principio di singola responsabilità.

source: Write readable code to avoid descriptive comments like: ``x++; /* Add 1 to x */``.
it_it: Scrivere codice leggibile per evitare commenti descrittivi come: ``x++; /* Aggiunge 1 a x */``.

source: Write, load, edit, or generate user interfaces described in the LVGL XML Specification for **internal use** only, including automation or configuration tools used solely inside your organization.
it_it: Scrivere, caricare, modificare o generare interfacce utente descritte nella Specifica XML LVGL solo per **uso interno**, inclusi gli strumenti di automazione o configurazione utilizzati esclusivamente all'interno della propria organizzazione.

source: Writing a LVGL Application
it_it: Scrivere un'Applicazione LVGL

source: Written in C for maximal compatibility (C++ compatible)
it_it: Scritto in C per la massima compatibilità (anche col C++)

source: X and Y translation
it_it: Traslazione X e Y

source: X11 Display/Inputs driver
it_it: Driver Display/Input X11

source: X11 on Linux
it_it: X11 su Linux

source: XML Components
it_it: Componenti XML

source: XML License
it_it: Licenza XML

source: XML Overview
it_it: Panoramica XML

source: XML Parser
it_it: Parser XML

source: XML animations are built on top of :ref:`Timeline animations <animations_timeline>`.
it_it: Le animazioni XML sono basate sulle :ref:`Timeline delle animazioni <animations_timeline>`.

source: XML parsers must handle mapping enum string names (e.g. ``"normal"``) to C enums (e.g. ``MY_WIDGET_MODE_NORMAL``).
it_it: I parser XML devono gestire la mappatura dei nomi delle stringhe enum (ad esempio ``"normal"``) agli enum C (ad esempio ``MY_WIDGET_MODE_NORMAL``).

source: YUV Packed Formats
it_it: Formati YUV Compressi

source: YUV Planar Formats
it_it: Formati Planari YUV

source: YUV400 no chroma channel
it_it: YUV400 senza canale cromatico

source: YUV420 planar (2 plane), UV plane in 'U, V, U, V'
it_it: YUV420 planare (2 piani), piano UV in 'U, V, U, V'

source: YUV420 planar (2 plane), UV plane in 'V, U, V, U'
it_it: YUV420 planare (2 piani), piano UV in 'V, U, V, U'

source: YUV420 planar (3 plane)
it_it: YUV420 planare (3 piani)

source: YUV422 packed like 'U Y V Y'
it_it: YUV422 compresso come 'U Y V Y'

source: YUV422 packed like 'Y U Y V'
it_it: YUV422 compresso come 'Y U Y V'

source: YUV422 planar (3 plane)
it_it: YUV422 planare (3 piani)

source: YUV444 planar (3 plane)
it_it: YUV444 planare (3 piani)

source: Yes
it_it: Sì

source: Yocto Project Core Components
it_it: Componenti principali del progetto Yocto

source: Yocto Project Terms
it_it: Terminologia dello Yocto Project

source: Yocto Variables Glossary
it_it: Glossario delle Variabili di Yocto

source: You "use" an axis by associating it with a data series, which happens when the data series is created (more on this below).
it_it: Un asse si "utilizza" associandolo a una serie di dati, cosa che avviene al momento della creazione della serie di dati (maggiori dettagli di seguito).

source: You add 1 Span (as a child) to the Spangroup for each "span" of uniquely-styled text needed.
it_it: Si aggiunge 1 Span (come elemento figlio) allo Spangroup per ogni "span" di testo con stile univoco necessario.

source: You also need to use LVGL's file system module and register a driver with some functions for basic file operations.
it_it: È inoltre necessario utilizzare il modulo file system di LVGL e registrare un driver con alcune funzioni per le operazioni di base sui file.

source: You are **explicitly permitted** to:
it_it: È **esplicitamente consentito**:

source: You are **not permitted** to:
it_it: **Non è consentito**:

source: You are now ready to build your LVGL application for Torizon OS.
it_it: Ora si è pronti per compilare l'applicazione LVGL per Torizon OS.

source: You are permitted to:
it_it: È consentito:

source: You are responsible for ensuring the array you provide contains at least ``chart->point_cnt`` elements in it.
it_it: Si è responsabili di garantire che l'array fornito contenga almeno ``chart->point_cnt`` elementi.

source: You attach each :cpp:type:`lv_style_t` object to each Section it will apply to using :cpp:expr:`lv_scale_section_set_style(section, PART, style_pointer)`, where:
it_it: Aggiungere ciascun oggetto :cpp:type:`lv_style_t` a ogni Sezione a cui verrà applicato utilizzando :cpp:expr:`lv_scale_section_set_style(section, PART, style_pointer)`, dove:

source: You can `Download <https://github.com/lvgl/lvgl/archive/refs/heads/master.zip>`__ the latest version of LVGL from GitHub and simply copy it to Arduino's library folder.
it_it: Si può fare il `Download <https://github.com/lvgl/lvgl/archive/refs/heads/master.zip>`__ dell'ultima versione di LVGL da GitHub e copiarla semplicemente nella cartella della libreria di Arduino.

source: You can access the underlying lvgl :code:`lv_indev_t` for configuration.
it_it: È possibile accedere al :code:`lv_indev_t` di lvgl sottostante per la configurazione.

source: You can add "pop-up windows" to the *Top Layer* freely.
it_it: È possibile aggiungere liberamente "finestre pop-up" al *Layer Superiore*.

source: You can add Button and Label Widgets to the Header using these two functions.
it_it: È possibile aggiungere widget Button e Label all'Header utilizzando queste due funzioni.

source: You can add a delay between the commands by using the pseudo-command ``LV_LCD_CMD_DELAY_MS``, which must be followed by the delay given in 10ms units.
it_it: È possibile aggiungere un ritardo tra i comandi utilizzando lo pseudo-comando ``LV_LCD_CMD_DELAY_MS``, seguito dal ritardo specificato in unità di 10 ms.

source: You can add and remove data series at any time during a chart's life.
it_it: È possibile aggiungere e rimuovere serie di dati in qualsiasi momento durante la vita di un grafico.

source: You can add any Widgets to the Page.
it_it: È possibile aggiungere qualsiasi Widget alla Page.

source: You can add any number of data series to a chart by using
it_it: È possibile aggiungere un numero qualsiasi di serie di dati a un grafico utilizzando

source: You can add any number of image decoders.
it_it: È possibile aggiungere un numero qualsiasi di decodificatori di immagini.

source: You can add images to LVGL in three ways:
it_it: Si possono aggiungere immagini a LVGL in tre modi:

source: You can add, show, hide or remove cursors at any time during a chart's life.
it_it: È possibile aggiungere, mostrare, nascondere o rimuovere i cursori in qualsiasi momento durante la vita di un grafico.

source: You can also compile manually using pkg-config to query the necessary flags:
it_it: È anche possibile compilare manualmente utilizzando pkg-config per interrogare i flag necessari:

source: You can also create your own animations with Adobe After Effects or similar software.
it_it: È anche possibile creare animazioni personalizzate con Adobe After Effects o software simili.

source: You can also find all the configurations in the Buildroot repository ``buildroot > configs``
it_it: Si possono trovare tutte le configurazioni anche nel repository Buildroot ``buildroot > configs``

source: You can also find the folder architecture created in ``lvgl_yocto_guide/ build/tmp/work/cortexa53-poky-linux/lvgl`` but these folders are empty since only the fetch was done.
it_it: Si può anche trovare la cartella architecture creata in ``lvgl_yocto_guide/ build/tmp/work/cortexa53-poky-linux/lvgl`` ma queste cartelle sono vuote poiché è stato eseguito solo il fetch.

source: You can also move through directories on the SD card.
it_it: È anche possibile spostarsi tra le directory sulla scheda SD.

source: You can also save the obtained **path** and **file** name into an array through functions such as :cpp:func:`strcpy` and :cpp:func:`strcat` for later use.
it_it: È anche possibile salvare il **path** e il nome del **file** ottenuti in un array tramite funzioni come :cpp:func:`strcpy` e :cpp:func:`strcat` per un utilizzo successivo.

source: You can also set ``Default driver letter`` to 65 to skip the prefix in file paths.
it_it: È anche possibile impostare ``Default driver letter`` a 65 per ignorare il prefisso nei path dei file.

source: You can also set a ``delay`` and ``reverse="true"`` when playing a timeline.
it_it: Si può anche impostare ``delay`` e ``reverse="true"`` durante la riproduzione di una timeline.

source: You can also set a symbol as an image source similar to a :ref:`Labels <lv_label>`.
it_it: È anche possibile impostare un simbolo come sorgente dell'immagine, in modo simile a :ref:`Label <lv_label>`.

source: You can also specify the library version to use.
it_it: Si può anche specificare la versione della libreria da utilizzare.

source: You can also use a path to find nested children: :cpp:expr:`lv_obj_get_child_by_name(cont, "buttons/mybtn_2")`.
it_it: Si può anche usare un path per trovare gli elementi figlio annidati: :cpp:expr:`lv_obj_get_child_by_name(cont, "buttons/mybtn_2")`.

source: You can also use percentages:
it_it: È anche possibile utilizzare le percentuali:

source: You can also use the ``LV_OPA_*`` defines in :cpp:func:`lv_color_mix` as a mixing *ratio*.
it_it: È anche possibile utilizzare le definizioni ``LV_OPA_*`` in :cpp:func:`lv_color_mix` come *rapporto* di miscelazione.

source: You can also visually increase the widget size without affecting layout:
it_it: È anche possibile aumentare visivamente le dimensioni del widget senza influire sul layout:

source: You can ask questions in the forum: https://forum.lvgl.io/.
it_it: Si possono porre domande nel forum: https://forum.lvgl.io/.

source: You can assign a :ref:`Text area <lv_textarea>` to the Keyboard to automatically put the clicked characters there.
it_it: È possibile assegnare un':ref:`Area di testo <lv_textarea>` alla tastiera per posizionarvi automaticamente i caratteri cliccati.

source: You can assign one or more callbacks to a Widget which will be called when the Widget is clicked, released, dragged, being deleted, etc.
it_it: È possibile assegnare una o più callback a un Widget, che verranno richiamate quando il Widget verrà cliccato, rilasciato, trascinato, eliminato, ecc.

source: You can attach custom event handlers to respond to interactions if needed.
it_it: È possibile associare gestori eventi personalizzati per rispondere alle interazioni, se necessario.

source: You can change a chart's type with :cpp:expr:`lv_chart_set_type(chart, LV_CHART_TYPE_...)`.
it_it: È possibile modificare il tipo di un grafico con :cpp:expr:`lv_chart_set_type(chart, LV_CHART_TYPE_...)`.

source: You can change the chart's type at any point during its life.
it_it: È possibile modificare il tipo di grafico in qualsiasi momento durante la sua implementazione.

source: You can change these ranges with:
it_it: È possibile modificare questi intervalli con:

source: You can change this behavior using :cpp:expr:`lv_switch_set_orientation(widget, orientation)`.
it_it: È possibile modificare questo comportamento utilizzando :cpp:expr:`lv_switch_set_orientation(widget, orientation)`.

source: You can change this if you wish.
it_it: È modificabile.

source: You can check the list of available boards using:
it_it: Si può consultare l'elenco delle schede disponibili usando:

source: You can choose from many different ways of contributing.
it_it: Si può scegliere tra diversi modi.

source: You can clone it or `Download <https://github.com/lvgl/lvgl/archive/refs/heads/master.zip>`__ the latest version of the library from GitHub.
it_it: Lo si può clonare o eseguire il `Download <https://github.com/lvgl/lvgl/archive/refs/heads/master.zip>`__ dell'ultima versione della libreria da GitHub.

source: You can combine multiple flags in one call using the bitwise OR operator (``|``).
it_it: È possibile combinare più flag in un'unica chiamata utilizzando l'operatore OR bit a bit (``|``).

source: You can configure LVGL in ``menuconfig``.
it_it: È possibile configurare LVGL in ``menuconfig``.

source: You can connect to the Docker container as a VS Code remote dev container.
it_it: È possibile connettersi al container Docker per lo sviluppo da remoto con VS Code.

source: You can continue writing and rebuilding simply by running the script again.
it_it: Si può continuare a scrivere e ricompilare semplicemente eseguendo nuovamente lo script.

source: You can control the Path (curve) of an Animation.
it_it: È possibile controllare il Percorso (curva) di un'Animazione.

source: You can create :ref:`multiple displays <multiple_displays>` with a different driver for each (see below).
it_it: È possibile creare :ref:`più display <multiple_displays>` con un driver diverso per ciascuno (vedere di seguito).

source: You can create a *feature branch* from the ``master`` branch for the updates: ``git checkout -b <new-feature-branch-name>``
it_it: Si può creare un *feature branch* dal branch ``master`` per gli aggiornamenti: ``git checkout -b <new-feature-branch-name>``

source: You can create a frogfs blob for use in LVGL by using the upstream frogfs project.
it_it: Si può creare un blob frogfs da utilizzare in LVGL utilizzando il progetto frogfs upstream.

source: You can create a larger virtual display from an array of smaller ones.
it_it: È possibile creare un display virtuale più grande da un array di display più piccoli.

source: You can create a series of related animations that are linked together using an Animation Timeline.
it_it: È possibile creare una serie di animazioni correlate collegate tra loro utilizzando una Timeline di Animazione.

source: You can create custom filters very easily.
it_it: È possibile creare filtri personalizzati molto facilmente.

source: You can create it by:
it_it: È possibile crearlo:

source: You can create one later if you wish.
it_it: Se ne può creare una in seguito, volendo.

source: You can create this using:
it_it: È possibile crearlo utilizzando:

source: You can create your own window decorations using LVGL widgets.
it_it: Si possono creare le proprie decorazioni per window utilizzando i widget LVGL.

source: You can customize a Yocto image+SDK or use the pre-built ones.
it_it: È possibile personalizzare un'immagine Yocto+SDK o utilizzare quelli predefiniti.

source: You can define how to pad the areas outside of the start and end points or angles:
it_it: È possibile definire come riempire le aree esterne ai punti o angoli di inizio e fine:

source: You can disable the LVGL demos (``lv_demo_benchmark()``) (or just comment them out) and call some ``lv_example_...()`` functions, or add your own custom code.
it_it: È possibile disabilitare le demo LVGL (``lv_demo_benchmark()``) (o semplicemente commentarle) e chiamare alcune funzioni ``lv_example_...()``, oppure aggiungere codice personalizzato.

source: You can disable the LVGL demos (or just comment them out) and call some ``lv_example_...()`` functions, or add your own custom code.
it_it: È possibile disabilitare le demo LVGL (o semplicemente commentarle) e chiamare alcune funzioni ``lv_example_...()``, oppure aggiungere codice personalizzato.
